# Lesson 2

<h2>Numpy</h2>

<h3>Задание 1</h3>
Импортируйте библиотеку Numpy и дайте ей псевдоним np.
Создайте массив Numpy под названием a размером 5x2, то есть состоящий из 5 строк и 2 столбцов. Первый столбец должен содержать числа 1, 2, 3, 3, 1, а второй - числа 6, 8, 11, 10, 7. Будем считать, что каждый столбец - это признак, а строка - наблюдение. Затем найдите среднее значение по каждому признаку, используя метод mean массива Numpy. Результат запишите в массив mean_a, в нем должно быть 2 элемента.

In [1]:
import numpy as np

a = np.array([[1, 2, 3, 3, 1], [6, 8, 11, 10, 7]]).T
mean_a = a.mean(axis=0)
mean_a

array([2. , 8.4])

<h3>Задание 2</h3>
Вычислите массив <b>a_centered</b>, отняв от значений массива “а” средние значения соответствующих признаков, содержащиеся в массиве mean_a. Вычисление должно производиться в одно действие. Получившийся массив должен иметь размер 5x2.

In [2]:
a_centered = a - mean_a
a_centered

array([[-1. , -2.4],
       [ 0. , -0.4],
       [ 1. ,  2.6],
       [ 1. ,  1.6],
       [-1. , -1.4]])

<h3>Задание 3</h3>
Найдите скалярное произведение столбцов массива a_centered. В результате должна получиться величина a_centered_sp. Затем поделите a_centered_sp на N-1, где N - число наблюдений.

In [3]:
a_centered_sp = np.dot(a_centered.T[0], a_centered.T[1])
a_centered_sp / (a_centered.shape[0] - 1)

2.0

<h3>Задание 4**</h3>
Число, которое мы получили в конце задания 3 является ковариацией двух признаков, содержащихся в массиве “а”. В задании 4 мы делили сумму произведений центрированных признаков на N-1, а не на N, поэтому полученная нами величина является несмещенной оценкой ковариации.
<br>
В этом задании проверьте получившееся число, вычислив ковариацию еще одним способом - с помощью функции np.cov. В качестве аргумента m функция np.cov должна принимать транспонированный массив “a”. В получившейся ковариационной матрице (массив Numpy размером 2x2) искомое значение ковариации будет равно элементу в строке с индексом 0 и столбце с индексом 1.

In [4]:
a_cov = np.cov(a.T)[0, 1]
a_cov

2.0

<h2>Pandas</h2>

<h3>Задание 1</h3>
Импортируйте библиотеку Pandas и дайте ей псевдоним pd.<br> Создайте датафрейм authors со столбцами author_id и author_name, в которых соответственно содержатся данные: <br>[1, 2, 3] и ['Тургенев', 'Чехов', 'Островский'].<br>
Затем создайте датафрейм book cо столбцами author_id, book_title и price, в которых соответственно содержатся данные: <br> 
[1, 1, 1, 2, 2, 3, 3],<br>
['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],<br>
[450, 300, 350, 500, 450, 370, 290].

In [5]:
import pandas as pd

In [6]:
dict_ = {'author_id': [1, 2, 3],
         'author_name': ['Тургенев', 'Чехов', 'Островсикй']}
authors = pd.DataFrame(dict_)
dict_ = {'author_id': [1, 1, 1, 2, 2, 3, 3],
         'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 
                        'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
         'price': [450, 300, 350, 500, 450, 370, 290]}
book = pd.DataFrame(dict_)

In [7]:
authors.head()

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островсикй

In [8]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

<h3>Задание 2</h3>
Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.

In [9]:
authors_price = pd.merge(authors, book, on='author_id', how='outer')
# same result with given data
# authors_price = pd.merge(authors, book, on='author_id', how='right')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островсикй                 Гроза    370
6          3  Островсикй  Таланты и поклонники    290

<h3>Задание 3</h3>
Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими книгами.

In [13]:
top5 = authors_price.sort_values(by='price', ascending=False).iloc[:5, :]
top5.reset_index(drop=True)

   author_id author_name         book_title  price
0          2       Чехов   Толстый и тонкий    500
1          1    Тургенев        Отцы и дети    450
2          2       Чехов    Дама с собачкой    450
3          3  Островсикй              Гроза    370
4          1    Тургенев  Дворянское гнездо    350

In [14]:
top5 = authors_price.nlargest(5, 'price')
top5.reset_index(drop=True)

   author_id author_name         book_title  price
0          2       Чехов   Толстый и тонкий    500
1          1    Тургенев        Отцы и дети    450
2          2       Чехов    Дама с собачкой    450
3          3  Островсикй              Гроза    370
4          1    Тургенев  Дворянское гнездо    350

<h3>Задание 4</h3>
Создайте датафрейм authors_stat на основе информации из authors_price. <br>В датафрейме authors_stat должны быть четыре столбца:<br>
author_name, min_price, max_price и mean_price,<br>
в которых должны содержаться соответственно имя автора, минимальная, максимальная и средняя цена на книги этого автора.

In [16]:
authors_stat = authors_price.groupby(by='author_name').agg({'price': ['min', 'max', 'mean']})

In [17]:
authors_stat.columns = ['min_price', 'max_price', 'mean_price']
authors_stat.reset_index()

  author_name  min_price  max_price  mean_price
0  Островсикй        290        370  330.000000
1    Тургенев        300        450  366.666667
2       Чехов        450        500  475.000000

<h3>Задание 5**</h3>
Создайте новый столбец в датафрейме authors_price под названием cover, в нем будут располагаться данные о том, какая обложка у данной книги - твердая или мягкая. В этот столбец поместите данные из следующего списка:
['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая'].<br>
Просмотрите документацию по функции pd.pivot_table с помощью вопросительного знака.Для каждого автора посчитайте суммарную стоимость книг в твердой и мягкой обложке. Используйте для этого функцию pd.pivot_table. При этом столбцы должны называться "твердая" и "мягкая", а индексами должны быть фамилии авторов. Пропущенные значения стоимостей заполните нулями, при необходимости загрузите библиотеку Numpy.<br>
Назовите полученный датасет book_info и сохраните его в формат pickle под названием "book_info.pkl". Затем загрузите из этого файла датафрейм и назовите его book_info2. Удостоверьтесь, что датафреймы book_info и book_info2 идентичны.

In [18]:
authors_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
authors_price.head(2)

   author_id author_name   book_title  price    cover
0          1    Тургенев  Отцы и дети    450  твердая
1          1    Тургенев        Рудин    300   мягкая

In [58]:
?pd.pivot_table

In [19]:
book_info = pd.pivot_table(data=authors_price, values='price', index=['author_name'],
                           columns=['cover'], aggfunc=np.sum, fill_value=0)

In [24]:
book_info['мягкая'] = book_info['мягкая'].astype(float)
book_info['твердая'] = book_info['твердая'].astype(float)
book_info

cover        мягкая  твердая
author_name
Островсикй    660.0      0.0
Тургенев      650.0    450.0
Чехов           0.0    950.0

In [25]:
import pickle
with open('db.pkl', 'wb') as file:
    file.write(pickle.dumps(book_info))

In [26]:
book_info2 = pickle.loads(open('db.pkl', 'rb').read())

In [27]:
book_info2

cover        мягкая  твердая
author_name
Островсикй    660.0      0.0
Тургенев      650.0    450.0
Чехов           0.0    950.0

In [28]:
book_info.to_pickle('db.pkl')

In [29]:
book_info2 = pd.read_pickle('db.pkl')

In [30]:
book_info2

cover        мягкая  твердая
author_name
Островсикй    660.0      0.0
Тургенев      650.0    450.0
Чехов           0.0    950.0

In [31]:
book_info.equals(book_info2)

True